#include "pwm_led.h"

void pwm_led1_set(uint16_t pwm);
void pwm_led2_set(uint16_t pwm);
void pwm_led3_set(uint16_t pwm);
void pwm_led4_set(uint16_t pwm);

/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大
****************************************************************
*/
void pwm_led1_init(void) {
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1);
	pwm_led1_set(0);
}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大
****************************************************************
*/
void pwm_led2_init(void) {
	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_2);
	pwm_led2_set(0);
}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大
****************************************************************
*/
void pwm_led3_init(void) {
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_3);
	pwm_led3_set(0);
}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大
****************************************************************
*/
void pwm_led4_init(void) {
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_4);
	pwm_led4_set(0);
}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大，数值0-99,99最亮
****************************************************************
*/
void pwm_led1_set(uint16_t pwm) {
  __HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_1,pwm);
}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大，数值0-99,99最亮
****************************************************************
*/
void pwm_led2_set(uint16_t pwm) {
  __HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_2,pwm);

}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大，数值0-99,99最亮
****************************************************************
*/
void pwm_led3_set(uint16_t pwm) {
  __HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_3,pwm);
}
/*
****************************************************************
设置可调亮度led,如果是pwm接在正极，pwm值越大亮度越大，数值0-99,99最亮
****************************************************************
*/
void pwm_led4_set(uint16_t pwm) {
  __HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_4,pwm);
}

