#include "mqx.h"

/****************************************功能说明****************************************

1.任意的GPIO均可,代码自动配置输入或输出
		
****************************************功能说明****************************************/

/**************************************************************************************
* 函数名称：mqx_init
* 功能描述：mq系列的气体传感器adc初始化
* 入口参数：无
* 出口参数：无
* 返 回 值：无
* 说    明：无
***************************************************************************************/
void mqx_init(void)
{
  HAL_ADCEx_Calibration_Start(&hadc1);
}
/**************************************************************************************
* 函数名称：mqx_adc_get
* 功能描述：获取adc数据
* 入口参数：无
* 出口参数：无
* 返 回 值：无
* 说    明：无
***************************************************************************************/
uint16_t mqx_adc_get(void)
{
	HAL_ADC_Start(&hadc1);  
	HAL_ADC_PollForConversion(&hadc1, 50);   

	if(HAL_IS_BIT_SET(HAL_ADC_GetState(&hadc1), HAL_ADC_STATE_REG_EOC))
	{
		return(HAL_ADC_GetValue(&hadc1));
	}
	return 0;
}
/**************************************************************************************
* 函数名称：mqx_get_data
* 功能描述：获取传感器数据
* 入口参数：adc通道[0-PA4 1-PA5 2-PA6 3-PA7]
* 出口参数：读取数据百分比
* 返 回 值：无
* 说    明：无
***************************************************************************************/
uint16_t mqx_get_data(uint8_t channel)
{
	uint16_t ADC_value[4] = {0};

  for(uint8_t i=0;i<4;i++)
  {
    ADC_value[i] = mqx_adc_get();
  }
	
	int value = ADC_value[channel];  
	
	float normalizedValue = (float)value / 4096; 
	int percentage = (int)(normalizedValue * 99);
  return percentage;
}
